# week 3 task 21
"""
текст задания                                                 тут 79 символ=>!
Дана строка. Замените в этой строке все цифры 1 на слово one.
"""
string = input()  # строковая переменная для ввода
search_string = "1"  # искомая строка
string = string.replace(search_string, "one")  # колво вхождений пробела
print(string)
