# week 3 task 22
"""
текст задания                                                 тут 79 символ=>!
Дана строка. Удалите из этой строки все символы @.
"""
string = input()  # строковая переменная для ввода
search_string = "@"  # искомая строка
string = string.replace(search_string, "")  # колво вхождений пробела
print(string)
