# week 3 task 20
"""
текст задания                                                 тут 79 символ=>!
Дана строка, состоящая из слов, разделенных пробелами.
Определите, сколько в ней слов.
"""
string = input()  # строковая переменная для ввода
search_string = " "  # искомая строка
number_of_entries = string.count(search_string)  # колво вхождений пробела
print(number_of_entries+1)
